backend: tensorflow
class_name: Model
config:
  input_layers:
  - [forward_pre_input, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 32]
      dtype: float32
      name: forward_pre_input
      sparse: false
    inbound_nodes: []
    name: forward_pre_input
  - class_name: Embedding
    config:
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32]
      dtype: float32
      embeddings_constraint: null
      embeddings_initializer:
        class_name: RandomUniform
        config: {maxval: 0.05, minval: -0.05, seed: null}
      embeddings_regularizer: null
      input_dim: 22
      input_length: 32
      mask_zero: false
      name: embedding_1
      output_dim: 32
      trainable: true
    inbound_nodes:
    - - - forward_pre_input
        - 0
        - 0
        - {}
    name: embedding_1
  - class_name: ZeroPadding1D
    config:
      name: zero_padding1d_1
      padding: !!python/tuple [3, 3]
      trainable: true
    inbound_nodes:
    - - - embedding_1
        - 0
        - 0
        - {}
    name: zero_padding1d_1
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [7]
      name: conv1d_1
      padding: valid
      strides: !!python/tuple [2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - zero_padding1d_1
        - 0
        - 0
        - {}
    name: conv1d_1
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      freeze: false
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_1
        - 0
        - 0
        - {}
    name: batch_normalization_1
  - class_name: Activation
    config: {activation: elu, name: activation_1, trainable: true}
    inbound_nodes:
    - - - batch_normalization_1
        - 0
        - 0
        - {}
    name: activation_1
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3]
      name: conv1d_2
      padding: valid
      strides: !!python/tuple [2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_1
        - 0
        - 0
        - {}
    name: conv1d_2
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      freeze: false
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_2
        - 0
        - 0
        - {}
    name: batch_normalization_2
  - class_name: Activation
    config: {activation: elu, name: activation_2, trainable: true}
    inbound_nodes:
    - - - batch_normalization_2
        - 0
        - 0
        - {}
    name: activation_2
  - class_name: ZeroPadding1D
    config:
      name: zero_padding1d_2
      padding: !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - {}
    name: zero_padding1d_2
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3]
      name: conv1d_3
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - zero_padding1d_2
        - 0
        - 0
        - {}
    name: conv1d_3
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      freeze: false
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_3
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_3
        - 0
        - 0
        - {}
    name: batch_normalization_3
  - class_name: Activation
    config: {activation: elu, name: activation_3, trainable: true}
    inbound_nodes:
    - - - batch_normalization_3
        - 0
        - 0
        - {}
    name: activation_3
  - class_name: ZeroPadding1D
    config:
      name: zero_padding1d_3
      padding: !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - activation_3
        - 0
        - 0
        - {}
    name: zero_padding1d_3
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3]
      name: conv1d_4
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - zero_padding1d_3
        - 0
        - 0
        - {}
    name: conv1d_4
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1]
      name: conv1d_5
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - {}
    name: conv1d_5
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      freeze: false
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_4
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_4
        - 0
        - 0
        - {}
    name: batch_normalization_4
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      freeze: false
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_5
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_5
        - 0
        - 0
        - {}
    name: batch_normalization_5
  - class_name: Add
    config: {name: add_1, trainable: true}
    inbound_nodes:
    - - - batch_normalization_4
        - 0
        - 0
        - &id001 {}
      - - batch_normalization_5
        - 0
        - 0
        - *id001
    name: add_1
  - class_name: Activation
    config: {activation: elu, name: activation_4, trainable: true}
    inbound_nodes:
    - - - add_1
        - 0
        - 0
        - {}
    name: activation_4
  - class_name: ZeroPadding1D
    config:
      name: zero_padding1d_4
      padding: !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - activation_4
        - 0
        - 0
        - {}
    name: zero_padding1d_4
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3]
      name: conv1d_6
      padding: valid
      strides: !!python/tuple [2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - zero_padding1d_4
        - 0
        - 0
        - {}
    name: conv1d_6
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      freeze: false
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_6
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_6
        - 0
        - 0
        - {}
    name: batch_normalization_6
  - class_name: Activation
    config: {activation: elu, name: activation_5, trainable: true}
    inbound_nodes:
    - - - batch_normalization_6
        - 0
        - 0
        - {}
    name: activation_5
  - class_name: ZeroPadding1D
    config:
      name: zero_padding1d_5
      padding: !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - activation_5
        - 0
        - 0
        - {}
    name: zero_padding1d_5
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3]
      name: conv1d_7
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - zero_padding1d_5
        - 0
        - 0
        - {}
    name: conv1d_7
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1]
      name: conv1d_8
      padding: valid
      strides: !!python/tuple [2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_4
        - 0
        - 0
        - {}
    name: conv1d_8
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      freeze: false
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_7
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_7
        - 0
        - 0
        - {}
    name: batch_normalization_7
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      freeze: false
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_8
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_8
        - 0
        - 0
        - {}
    name: batch_normalization_8
  - class_name: Add
    config: {name: add_2, trainable: true}
    inbound_nodes:
    - - - batch_normalization_7
        - 0
        - 0
        - &id002 {}
      - - batch_normalization_8
        - 0
        - 0
        - *id002
    name: add_2
  - class_name: Activation
    config: {activation: elu, name: activation_6, trainable: true}
    inbound_nodes:
    - - - add_2
        - 0
        - 0
        - {}
    name: activation_6
  - class_name: ZeroPadding1D
    config:
      name: zero_padding1d_6
      padding: !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - activation_6
        - 0
        - 0
        - {}
    name: zero_padding1d_6
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3]
      name: conv1d_9
      padding: valid
      strides: !!python/tuple [2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - zero_padding1d_6
        - 0
        - 0
        - {}
    name: conv1d_9
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      freeze: false
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_9
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_9
        - 0
        - 0
        - {}
    name: batch_normalization_9
  - class_name: Activation
    config: {activation: elu, name: activation_7, trainable: true}
    inbound_nodes:
    - - - batch_normalization_9
        - 0
        - 0
        - {}
    name: activation_7
  - class_name: ZeroPadding1D
    config:
      name: zero_padding1d_7
      padding: !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - activation_7
        - 0
        - 0
        - {}
    name: zero_padding1d_7
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3]
      name: conv1d_10
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - zero_padding1d_7
        - 0
        - 0
        - {}
    name: conv1d_10
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1]
      name: conv1d_11
      padding: valid
      strides: !!python/tuple [2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_6
        - 0
        - 0
        - {}
    name: conv1d_11
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      freeze: false
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_10
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_10
        - 0
        - 0
        - {}
    name: batch_normalization_10
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      freeze: false
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_11
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_11
        - 0
        - 0
        - {}
    name: batch_normalization_11
  - class_name: Add
    config: {name: add_3, trainable: true}
    inbound_nodes:
    - - - batch_normalization_10
        - 0
        - 0
        - &id003 {}
      - - batch_normalization_11
        - 0
        - 0
        - *id003
    name: add_3
  - class_name: Activation
    config: {activation: elu, name: activation_8, trainable: true}
    inbound_nodes:
    - - - add_3
        - 0
        - 0
        - {}
    name: activation_8
  - class_name: ZeroPadding1D
    config:
      name: zero_padding1d_8
      padding: !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - activation_8
        - 0
        - 0
        - {}
    name: zero_padding1d_8
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3]
      name: conv1d_12
      padding: valid
      strides: !!python/tuple [2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - zero_padding1d_8
        - 0
        - 0
        - {}
    name: conv1d_12
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      freeze: false
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_12
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_12
        - 0
        - 0
        - {}
    name: batch_normalization_12
  - class_name: Activation
    config: {activation: elu, name: activation_9, trainable: true}
    inbound_nodes:
    - - - batch_normalization_12
        - 0
        - 0
        - {}
    name: activation_9
  - class_name: ZeroPadding1D
    config:
      name: zero_padding1d_9
      padding: !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - activation_9
        - 0
        - 0
        - {}
    name: zero_padding1d_9
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3]
      name: conv1d_13
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - zero_padding1d_9
        - 0
        - 0
        - {}
    name: conv1d_13
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1]
      name: conv1d_14
      padding: valid
      strides: !!python/tuple [2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_8
        - 0
        - 0
        - {}
    name: conv1d_14
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      freeze: false
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_13
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_13
        - 0
        - 0
        - {}
    name: batch_normalization_13
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      freeze: false
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_14
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_14
        - 0
        - 0
        - {}
    name: batch_normalization_14
  - class_name: Add
    config: {name: add_4, trainable: true}
    inbound_nodes:
    - - - batch_normalization_13
        - 0
        - 0
        - &id004 {}
      - - batch_normalization_14
        - 0
        - 0
        - *id004
    name: add_4
  - class_name: Activation
    config: {activation: elu, name: activation_10, trainable: true}
    inbound_nodes:
    - - - add_4
        - 0
        - 0
        - {}
    name: activation_10
  - class_name: Bidirectional
    config:
      layer:
        class_name: CuDNNLSTM
        config:
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          go_backwards: false
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: cu_dnnlstm_1
          recurrent_constraint: null
          recurrent_initializer:
            class_name: Orthogonal
            config: {gain: 1.0, seed: null}
          recurrent_regularizer: null
          return_sequences: true
          return_state: false
          stateful: false
          trainable: true
          unit_forget_bias: true
          units: 512
      merge_mode: concat
      name: bidirectional_1
      trainable: true
    inbound_nodes:
    - - - activation_10
        - 0
        - 0
        - {}
    name: bidirectional_1
  - class_name: Attention
    config: {W_constraint: null, W_regularizer: null, b_constraint: null, b_regularizer: null,
      bias: true, context: false, name: attention_1, trainable: true, u_constraint: null,
      u_regularizer: null}
    inbound_nodes:
    - - - bidirectional_1
        - 0
        - 0
        - {}
    name: attention_1
  - class_name: Dropout
    config: {name: dropout_1, noise_shape: null, rate: 0.5, seed: null, trainable: true}
    inbound_nodes:
    - - - attention_1
        - 0
        - 0
        - {}
    name: dropout_1
  - class_name: Dense
    config:
      activation: elu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 512
      use_bias: true
    inbound_nodes:
    - - - dropout_1
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Dropout
    config: {name: dropout_2, noise_shape: null, rate: 0.5, seed: null, trainable: true}
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: dropout_2
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 1
      use_bias: true
    inbound_nodes:
    - - - dropout_2
        - 0
        - 0
        - {}
    name: dense_2
  name: model_1
  output_layers:
  - [dense_2, 0, 0]
keras_version: 2.2.4
